const grants = [
  {
    'title': '6В011 Педагогика и психология',
    'group': 'В001',
    'name': 'Педагогика и психология',
    'amount': '125'
  },
  {
    'title': '6В012 Педагогика дошкольного воспитания и обучения',
    'group': 'В002',
    'name': 'Дошкольное обучение',
    'amount': '350'
  },
  {
    'title': '6В013 Подготовка учителей без предметной специализации',
    'group': 'В003',
    'name': 'Педагогика и методика начального обучения',
    'amount': '345'
  },
  {
    'title': '6В015 Подготовка учителей по естественнонаучным предметам',
    'group': 'В009',
    'name': 'Подготовка учителей математики',
    'amount': '370'
  },
  {
    'title': '6В016 Подготовка учителей по гуманитарным предметам',
    'group': 'В015',
    'name': 'Подготовка учителей по гуманитарным предметам',
    'amount': '240'
  }
];
